app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3)
---
  def index
    @posts = Post.includes(:user).all